In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import glob

In [3]:
# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
        'Age': ['25', '30', '28', '24', '32']}
df = pd.DataFrame(data)

In [21]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28
3    Alice   24
4      Bob   32

In [5]:
# Convert the 'Age' column from string to integer
df['Age'] = df['Age'].astype(int)

In [30]:
# Perform a groupby operation, for example, grouping by 'Name' and calculating the average age
grouped_df = df.groupby('Name', axis=0, as_index=False)['Age'].sum().sort_values(by='Age', ascending=False).head(1)#.reset_index()

In [31]:
# Display the result
print(grouped_df)

  Name  Age
1  Bob   62

In [32]:
df.groupby('Name', axis=0, as_index=False)['Age'].sum().sort_values(by='Age', ascending=False).head(1)

  Name  Age
1  Bob   62

In [2]:
# create a DataFrame with a date column
df = pd.DataFrame({'date': ['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01', '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01', '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01'], 'value': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]})

In [3]:
df

          date  value
0   2022-01-01      1
1   2022-02-01      2
2   2022-03-01      3
3   2022-04-01      4
4   2022-05-01      5
5   2022-06-01      6
6   2022-07-01      7
7   2022-08-01      8
8   2022-09-01      9
9   2022-10-01     10
10  2022-11-01     11
11  2022-12-01     12

In [6]:
# convert the date column to a datetime object
df['date'] = pd.to_datetime(df['date'])

In [8]:
df = df.set_index('date')

In [10]:
df

            value
date
2022-01-01      1
2022-02-01      2
2022-03-01      3
2022-04-01      4
2022-05-01      5
2022-06-01      6
2022-07-01      7
2022-08-01      8
2022-09-01      9
2022-10-01     10
2022-11-01     11
2022-12-01     12

In [14]:
# group by month
df['date'].groupby(pd.Grouper(key='date',freq='M')).sum()

KeyError: 'date'

In [15]:
import pandas as pd

# Create a sample DataFrame
data = {
    'date': ['2023-01-15', '2023-01-20', '2023-02-10', '2023-02-25', '2023-03-05'],
    'value': [10, 15, 20, 25, 30]
}

df = pd.DataFrame(data)

# Convert the 'date' column to a datetime object
df['date'] = pd.to_datetime(df['date'])

# Group by month and aggregate the 'value' column using sum
result = df.groupby(pd.Grouper(key='date', freq='M')).sum()

# Display the result
print(result)

            value
date
2023-01-31     25
2023-02-28     45
2023-03-31     30

In [4]:
data = {'timestamp': ['2023-09-28 08:30:00', '2023-09-28 09:15:00', '2023-09-28 08:30:00', '2023-09-28 10:45:00']}
df = pd.DataFrame(data)

In [5]:
df['timestamp'] = pd.to_datetime(df['timestamp'])

In [6]:
hour_counts = df['timestamp'].dt.hour.value_counts()

In [7]:
most_repeated_hour = hour_counts.idxmax()

In [8]:
print(f"The most repeated hour is: {most_repeated_hour}")

The most repeated hour is: 8